from datetime import datetime

MONTHS = {
        '1': 'Январь',
        '2': 'Февраль',
        '3': 'Март',
        '4': 'Апрель',
        '5': 'Май',
        '6': 'Июнь',
        '7': 'Июль',
        '8': 'Август',
        '9': 'Сентябрь',
        '10': 'Октябрь',
        '11': 'Ноябрь',
        '12': 'Декабрь'
}

WEEK_DAYS = ['Понедельник', 'Вторник', 'Среда', 'Четверг',
             'Пятница', 'Суббота', 'Воскресенье']

# Выборка для нарядов и отпуска:
DUTY_NIGHT = ['Нн+', '+Нн', 'Нн']
DUTY_DAY = ['Нд+', '+Нд', 'Нд']
VACATION = ['Отпуск', 'отпуск']

WEATHER_TIMES = ['07:00', '10:00', '13:00', '16:00', '19:00', '22:00']

# Время уведомлений.
NOTIFICATION_TIME = datetime.strptime("22:00", "%H:%M").time()
WEATHER_NOTIFICATION_TIME = datetime.strptime("07:00", "%H:%M").time()
TIME_DELAY = 86400

# Праздники. Ключ - номер месяца, значение - дата.
HOLIDAYS = {
    '1': [1, 2, 3, 6, 7, 8],
    '2': [23],
    '3': [8],
    '4': [],
    '5': [1, 2, 8, 9],
    '6': [12, 13],
    '7': [],
    '8': [],
    '9': [],
    '10': [],
    '11': [3, 4],
    '12': [31]
}

# Эмоджи:
GAIN_EMOJI = '💪'
DUTY_EMOJI = '☎️'
VACATION_EMOJI = '🏖'
CURRENT_MONTH = '📆'
NEXT_MONTH = '🔜'
